---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinProf
source: html/d93b58e0-ba8f-1500-884b-7b36aa2e9ded.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinProf Property

The property labeled "Profile for secondary highlight perlin noise" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodSecondaryPerlinProf { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".